app/controllers/categorias.php

SELECT *
FROM `categorias`
---
    public function index()
    {
        $model = new CategoriaModel();
        $data['categorias'] = $model->findAll();