app/controllers/usuarios.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function index()
    {
        $userModel = new UserModel();

        // Obtener solo usuarios activos (no eliminados)
        $data['usuarios'] = $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '2'
---
    public function edit($id)
    {
        $userModel = new UserModel();
        $data['usuario'] = $userModel->find($id);